load-test/results-stress.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 100 VUs  00.0s/30s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  01.0s/30s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  02.0s/30s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  03.0s/30s

running (0m05.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  04.0s/30s

running (0m06.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  05.0s/30s

running (0m07.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  06.0s/30s

running (0m08.0s), 100/100 VUs, 1 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  07.0s/30s

running (0m09.0s), 100/100 VUs, 41 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  08.0s/30s

running (0m10.0s), 100/100 VUs, 55 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  09.0s/30s

running (0m11.0s), 100/100 VUs, 74 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  10.0s/30s

running (0m12.0s), 100/100 VUs, 90 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  11.0s/30s

running (0m13.0s), 100/100 VUs, 101 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  12.0s/30s

running (0m14.0s), 100/100 VUs, 119 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  13.0s/30s

running (0m15.0s), 100/100 VUs, 152 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  14.0s/30s

running (0m16.0s), 100/100 VUs, 164 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  15.0s/30s

running (0m17.0s), 100/100 VUs, 176 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  16.0s/30s

running (0m18.0s), 100/100 VUs, 190 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  17.0s/30s

running (0m19.0s), 100/100 VUs, 195 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  18.0s/30s

running (0m20.0s), 100/100 VUs, 215 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  19.0s/30s

running (0m21.0s), 100/100 VUs, 222 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  20.0s/30s

running (0m22.0s), 100/100 VUs, 241 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  21.0s/30s

running (0m23.0s), 100/100 VUs, 261 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  22.0s/30s

running (0m24.0s), 100/100 VUs, 276 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  23.0s/30s

running (0m25.0s), 100/100 VUs, 283 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  24.0s/30s

running (0m26.0s), 100/100 VUs, 289 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  25.0s/30s

running (0m27.0s), 100/100 VUs, 336 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  26.0s/30s

running (0m28.0s), 100/100 VUs, 343 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  27.0s/30s

running (0m29.0s), 100/100 VUs, 352 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  28.0s/30s

running (0m30.0s), 100/100 VUs, 368 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  29.0s/30s

running (0m31.0s), 100/100 VUs, 416 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  30s

running (0m32.0s), 094/100 VUs, 422 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  30s

running (0m33.0s), 086/100 VUs, 430 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  30s

running (0m34.0s), 056/100 VUs, 460 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  30s

running (0m35.0s), 007/100 VUs, 509 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  30s
     ✗ POST /Auth/login status is 200
      ↳  0% — ✓ 0 / ✗ 516
     ✗ POST /Auth/login response time < 2s
      ↳  54% — ✓ 280 / ✗ 236
     ✓ POST /Bookings server responded
     ✗ POST /Bookings response time < 2s
      ↳  48% — ✓ 252 / ✗ 264

     checks.........................: 50.77% ✓ 1048      ✗ 1016 
     data_received..................: 1.1 MB 30 kB/s
     data_sent......................: 688 kB 20 kB/s
     http_req_blocked...............: avg=19.95ms min=0s      med=0s    max=404.71ms p(90)=666.09µs p(95)=204.56ms
     http_req_connecting............: avg=6.34ms  min=0s      med=0s    max=74.87ms  p(90)=0s       p(95)=67.46ms 
   ✗ http_req_duration..............: avg=2.66s   min=79.99ms med=1.92s max=10.47s   p(90)=5.6s     p(95)=6.27s   
       { expected_response:true }...: avg=2.66s   min=79.99ms med=1.92s max=10.47s   p(90)=5.6s     p(95)=6.27s   
   ✓ http_req_failed................: 0.00%  ✓ 0         ✗ 1037 
     http_req_receiving.............: avg=1.99ms  min=0s      med=0s    max=637.4ms  p(90)=699.9µs  p(95)=938.79µs
     http_req_sending...............: avg=85.68µs min=0s      med=0s    max=12.63ms  p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=13.37ms min=0s      med=0s    max=159.18ms p(90)=0s       p(95)=136.59ms
     http_req_waiting...............: avg=2.65s   min=79.99ms med=1.92s max=10.47s   p(90)=5.6s     p(95)=6.26s   
     http_reqs......................: 1037   29.546927/s
     iteration_duration.............: avg=6.38s   min=1.67s   med=6.02s max=15.62s   p(90)=10.36s   p(95)=11.36s  
     iterations.....................: 516    14.702232/s
     vus............................: 7      min=7       max=100
     vus_max........................: 100    min=100     max=100
running (0m35.1s), 000/100 VUs, 516 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  30s